//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop
#include "Unit2.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TPersonalTrainer *PersonalTrainer;
//---------------------------------------------------------------------------
__fastcall TPersonalTrainer::TPersonalTrainer(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TPersonalTrainer::Button8Click(TObject *Sender)
{
Close();
}
//---------------------------------------------------------------------------
void __fastcall TPersonalTrainer::N9Click(TObject *Sender)
{
Close();
}
//---------------------------------------------------------------------------




void __fastcall TPersonalTrainer::BackButtonClick(TObject *Sender)
{   Label2->Hide();
	Button1->Show();
	Button2->Show();
	Button3->Show();
	Button4->Show();
	Button5->Show();
	Button6->Show();
	Button7->Show();
	Button8->Show();
	Button9->Hide();
	Button11->Hide();
	Button12->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Button16->Hide();
	Edit1->Hide();
	Button32->Hide();
	Button17->Hide();
	Button18->Hide();
	Button19->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Button24->Hide();
	Button25->Hide();
	Button26->Hide();
	Button27->Hide();
	Button28->Hide();
	Button29->Hide();
	Button30->Hide();
	Button31->Hide();
	BackButton1->Hide();
	BackButton2->Hide();
	BackButton->Hide();
	BackButton3->Hide();
	Button10->Hide();
	Memo1->Hide();
	Edit1->Hide();
	Button32->Hide();
	Button33->Hide();
	Button34->Hide();
	Button35->Hide();
	Button36->Hide();
	Button37->Hide();
	Button38->Hide();
	Button39->Hide();
	Button40->Hide();
	Button41->Hide();
	Button42->Hide();
	Button43->Hide();
	Button44->Hide();
	Button45->Hide();
	Button46->Hide();
	Button47->Hide();
	Button48->Hide();
	Button49->Hide();
	Label1->Show();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button4Click(TObject *Sender)
{   Label1->Hide();
	Button11->Show();
	Button9->Show();
	Button12->Show();
	Button13->Show();
	Button14->Show();
	Button15->Show();
	Button16->Show();
	BackButton->Show();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button10Click(TObject *Sender)
{
	Memo1->Hide();
	BackButton->Show();
	Button10->Hide();
	Button9->Show();
	Button11->Show();
	Button12->Show();
	Button13->Show();
	Button14->Show();
	Button15->Show();
	Button16->Show();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button9Click(TObject *Sender)
{
	Memo1->Clear();
	Memo1->Show();
	Button9->Hide();
	Button10->Show();
	BackButton->Hide();
	Memo1->Lines->Add("Искривление позвоночника и неправильная осанка — это не просто визуальная проблема. Горбатая спина может стать причиной многочисленных проблем со здоровьем, а плоскостопие — лишить способности ходить без боли в более взрослом возрасте. Однако осанку невозможно исправить за несколько минут.Достаточно одного упражнения, чтобы вернуть спину в прямое положение — однако сложно научить тело принимать и поддерживать это положение автоматически. Исправление осанки потребует полной перестройки всего корпуса — организм должен заново научиться держать тело и его мышцы правильно. Если вы горбитесь, то, вероятно, причина заключается в слишком низком расположении экрана компьютера на работе и в регулярном использовании смартфона, что заставляет смотреть вниз.");
	Button11->Hide();
	Button12->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Button16->Hide();
	}
//---------------------------------------------------------------------------


void __fastcall TPersonalTrainer::FormCreate(TObject *Sender)
{
	Button9->Top = 8;
	Button9->Left = 32;
	Button11->Top =  72;
	Button11->Left = 32;
	Memo1->Top = 84;
	Memo1->Left = 168;
	Button12->Top = 136;
	Button12->Left = 32;
	Button13->Top = 200;
	Button14->Top = 264;
	Button15->Top = 328;
	Button13->Left = 32;
	Button14->Left = 32;
	Button15->Left = 32;
	Button16->Top = 392;
	Button16->Left = 32;
	Button17->Left = 32;
	Button18->Left = 32;
	Button19->Left = 32;
	Button20->Left = 32;
	Button21->Left = 32;
	Button22->Left = 32;
	Button23->Left = 32;
	Button17->Top = 8;
	Button18->Top = 72;
	Button19->Top = 136;
	Button20->Top = 200;
	Button21->Top = 264;
	Button22->Top = 328;
	Button23->Top = 392;
	BackButton1->Top = 450;
	BackButton1->Left = 512;
	BackButton->Top = 450;
	BackButton->Left = 512;
	Button10->Top = 450;
	Button10->Left = 512;
	Button24->Top = 8;
	Button25->Top = 72;
	Button26->Top = 136;
	Button27->Top = 200;
	Button28->Top = 264;
	Button29->Top = 328;
	Button30->Top = 392;
	Button31->Top = 456;
	Button24->Left = 32;
	Button25->Left = 32;
	Button26->Left = 32;
	Button27->Left = 32;
	Button28->Left = 32;
	Button29->Left = 32;
	Button30->Left = 32;
	Button31->Left = 32;
	BackButton2->Top = 450;
	BackButton2->Left = 512;
	Label2->Top = 44;
	Label2->Left = 0;
	Edit1->Top = 39;
	Edit1->Left = 305;
	Button32->Top = 37;
	Button32->Left = 472;
	Button33->Top = 8;
	Button33->Left = 32;
	Button34->Top = 72;
	Button34->Left = 32;
	Button35->Top = 136;
	Button35->Left = 32;
	Button36->Top = 200;
	Button36->Left = 32;
	Button37->Top = 264;
	Button37->Left = 32;
	Button38->Top = 328;
	Button38->Left = 32;
	Button39->Top = 392;
	Button39->Left = 32;
	BackButton3->Top = 450;
	BackButton3->Left = 512;
	Button40->Left = 32;
	Button41->Left = 32;
	Button42->Left = 32;
	Button43->Left = 32;
	Button44->Left = 32;
	Button45->Left = 32;
	Button46->Left = 32;
	Button47->Left = 32;
	Button48->Left = 32;
	Button49->Left = 32;
	Button40->Top = 8;
	Button41->Top = 62;
	Button42->Top = 126;
	Button43->Top = 190;
	Button44->Top = 254;
	Button45->Top = 318;
	Button46->Top = 380;
	Button47->Top = 440;
	Button48->Top = 510;
	Button49->Top = 560;

	BackButton4->Top = 450;
	BackButton4->Left = 512;














}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button11Click(TObject *Sender)
{

	Memo1->Show();
	Memo1->Clear();
	Button11->Hide();
	Button10->Show();
	BackButton->Hide();
	Memo1->Lines->Add("Перестаньте горбиться. Постоянное нахождение в сидячем положении (начиная от работы в офисе, заканчивая вождением автомобиля) приводит к нарушению осанки. Также вредит и то, что при пользовании мобильным телефоном приходится смотреть вниз — это заставляет горбиться. Результатом становится постепенное снижение роста на несколько сантиметров.Расправьте плечи. Поддержание правильной осанки с расплавленными плечами и прямой спиной — простейший способ стать выше. Однако исправление осанки — сложная и комплексная терапия, которую лучше проводить с персональным тренером, способным корректировать именно вашу осанку, а не искать универсальные упражнения в интернете.Укрепляйте мышцы корпуса. Развитые мышцы верха спины и плеч не только облегчат ежедневное поддержание правильной осанки, но и заложат основу спортивному телосложению. Напомним, что лучшими упражнениями для развития спины являются подтягивания и тяга верхнего блока к груди сидя.");
	Button9->Hide();
	Button12->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Button16->Hide();
	}
//---------------------------------------------------------------------------




void __fastcall TPersonalTrainer::Button12Click(TObject *Sender)
{
	Memo1->Show();
	Memo1->Clear();
	Button11->Hide();
	Button12->Hide();
	Button10->Show();
	BackButton->Hide();
	Memo1->Lines->Add("Ношение тяжелых рюкзаков — одна из самых частых причин нарушения осанки и искривления позвоночника(1). Вес рюкзака заставляет плечи опускаться вперед, создавая при этом прогиб в спине. Если же рюкзак одет всего одной лямкой, позвоночник искривляется и в сторону.Если девушки чаще всего знают о том, что обувь на высоком каблуке негативно сказывается на позвоночнике, то мало кто из мужчин задумывается, что обувь совершенно без каблука (кеды, сандалии и шлепки) также является вредной, провоцируя плоскостопие и нарушения походки.Даже работа перед компьютером в максимально правильной позиции, при которой ноги стоят на полу, угол между бедрами и туловищем составляет 90-120°, угол сгиба локтей приближен к 90°, а экран находится на уровне взгляда (чуть выше стола) приводит к ухудшению осанки.");
	Button9->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Button16->Hide();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button13Click(TObject *Sender)
{   Memo1->Show();
	Button16->Hide();
	Memo1->Clear();
	Button11->Hide();
	Button12->Hide();
	Button10->Show();
	BackButton->Hide();
	Button9->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Memo1->Lines->Add("Дыхание, в результате которого воздух направляется в грудную клетку, а не в живот, является неправильным. Мышцы диафрагмы в этом случае движутся не вверх-вниз, а вперед, сжимая и ограничивая легкие. Кроме этого, такой способ дыхания заставляет дышать ртом, а не носом.Вспомните, как дышат дети — они дышат носом, а при дыхании верхняя часть их животика опускается и поднимается, тогда как грудь практически не движется. Такое дыхание называется «диафрагменным» и является наиболее естественным для человека.Займите наиболее удобное для вас положение — сидя, стоя или лежа. Положите левую руку на грудную клетку, правую – на живот. Старайтесь дышать нормально. Посвятите несколько минут наблюдению за тем, как именно вы дышите и движется ли при этом живот или грудь.По сути, одной из главных функций носа является фильтрация поступающего в легкие воздуха.");

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button14Click(TObject *Sender)
{
	Memo1->Show();
	Memo1->Clear();
	Button11->Hide();
	Button12->Hide();
	Button10->Show();
	BackButton->Hide();
	Button9->Hide();
	Button13->Hide();
	Button16->Hide();
	Button14->Hide();
	Button15->Hide();
	Memo1->Lines->Add("Профессор Harvard University Дэниэл Либерман, исследуя влияние бега на здоровье (и особенно на колени), пришел к заключению, которое переворачивает все отношение к этому вопросу:  бегать полезно, но только босиком, либо в обуви с минимальной подошвой(1).В основе современного навязанного рекламой восприятия бега лежит то, чтобы бегать, нам обязательно нужна пара кроссовок и специальное покрытие. Но исследования доктора Либермана показывают, что при беге босиком не нужно ничего.Согласно этому исследованию, при беге стопа касается земли одним из трех способов: пяткой, пяткой и носком одновременно, носком. Большая часть спринтеров при беге сперва касается земли носком, а 75-80% марафонцев сперва касаются поверхности пяткой.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button15Click(TObject *Sender)
{   Button16->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button11->Hide();
	Button12->Hide();
	Button10->Show();
	BackButton->Hide();
	Button9->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Memo1->Lines->Add("Созданная за многие годы привычка спать в неправильной позе или способность засыпать исключительно перед телевизором на диване — серьезные проблемы, с которыми нужно бороться. Вероятно, что в первые дни правильная поза для сна покажется вам крайне неудобной, но постепенно вы привыкните.Выбирая правильную позу для сна, сперва убедитесь в том, что матрас и подушка подобраны верно. После этого переходите к тестированию сна на спине — если такой сон даже с двумя маленькими подушками не покажется вам удобным, переходите ко сну на боку.Сон на боку — одна из двух рекомендованных поз для сна, подходящих практически любому человеку. Однако важную роль играет то, на каком боку вы спите. Сон на правом боку может провоцировать изжогу, тогда как сон на левом снижает выработку кислоты в желудке и полезен при рефлюксной болезни.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button16Click(TObject *Sender)
{
Button16->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button11->Hide();
	Button12->Hide();
	Button10->Show();
	BackButton->Hide();
	Button9->Hide();
	Button13->Hide();
	Button14->Hide();
	Button15->Hide();
	Memo1->Lines->Add("1.ХАТХА-ЙОГА:Первоисточник современных направлений йоги. Стиль – статический. Каждая асана удерживается течение нескольких минут, очень большое внимание уделяется медитации и дыханию. Призвана восстановить физическое здоровье человека, вернуть подвижность суставам, укрепить иммунитет, нормализовать давление и пищеварение.\n 2.ЙОГА-АЙЕНГАРА:Стиль – статический. Отличается от других стилей своей медлительностью, главной целью является правильное выполнение асан – начиная с легких, ученик переходит к более сложным.\n 3.ШИВАНАНДА-ЙОГА:Стиль – статический. Главное отличие от йоги Айенгара состоит в принятии релаксации самым важным пунктом. Считается, что лишь тогда, когда вы полностью расслаблены, асаны принесут пользу и трансформируют не только тело, но и дух.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button7Click(TObject *Sender)
{
  Memo1->Show();
  Memo1->Clear();
  Memo1->Lines->Add("Отличное приложение с хорошими упражнениями. Все доступно и понятно. Эффективные программы тренировок для увеличения объёма тела,а так же различные диеты,ценность витаминов,типы телосложения.\n Список тренировок: 1)Идеальный пресс; 2)Мощные ноги; 3)Верхняя часть тела; 4)Сожги жир; 5)Идеальное тело+ можно самому составить собственную тренировку.\nПрограмма тренировок включает:1) Правильный комплекс упражнений и инструкции по разминке.2) Сбалансированный, продуманный режим тренировок и отдыха, как для отдельных мышц, так и для всего организма.3) Я рекомендую вести дневник тренировок, в котором вы будете записывать свои достижения, различные параметры, рабочие отягощения и нагрузки.Программа создана студентом гр.653502,Жевняком В.И. Удачных тренировок :)");
  Button1->Hide();
  Button2->Hide();
  Button3->Hide();
  Button4->Hide();
  Button5->Hide();
  Button6->Hide();
  Button7->Hide();
  Button8->Hide();
  BackButton->Show();
  }
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button6Click(TObject *Sender)
{
	Label1->Hide();
	Button23->Show();
	Button17->Show();
	Button18->Show();
	Button19->Show();
	Button20->Show();
	Button21->Show();
	Button22->Show();
	BackButton->Show();
	BackButton1->Hide();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button9->Hide();


}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button17Click(TObject *Sender)
{   Memo1->Clear();
	Memo1->Show();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button17->Hide();
	BackButton1->Show();
	BackButton->Hide();
	Button18->Hide();
	Button19->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Memo1->Lines->Add("Магний — главный минерал для здоровья спортсмена, однако лишь один из четырех потребляет его достаточное количество.Магний ответственен за энергетический обмен клеток — он регулирует процессы углеводного обмена, активизирует образование белков, способствует высвобождению энергии при физических нагрузках, а также регулирует процессы возбуждения и расслабления в мозге и в центральной нервной системе(2).Потребность организма в магнии повышается при занятиях силовыми тренировками или любыми другими физическими нагрузками.Суммарно в организме взрослого человека находится порядка 22-26 граммов магния, большая часть из которого запасена в костях, примерно по 20% — в мышцах и в клетках.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button18Click(TObject *Sender)
{
	Memo1->Show();
	Button17->Hide();
	Memo1->Clear();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button18->Hide();
	Button19->Hide();
	Button10->Hide();
	BackButton1->Show();
	BackButton->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	BackButton->Hide();
	Memo1->Lines->Add("Все мы знаем, что полный и сбалансированный рацион обеспечивает организм витаминами и минералами — но мало кто из нас действительно съедает достаточное количество шпината (источник витамина К), морепродуктов (йод), оливкового масла (витамин Е) и тыквы (витамин А).В зимнее время большинство людей страдают от недостатка важнейшего для иммунитета и здоровья костей витамина D. Для того, чтобы получать его необходимую дозу, необходимо находиться на ярком солнце не менее 60 минут в неделю — зимой это малореально.Первое, на что стоит обращать внимание при выборе витаминного комплекса — покрытие дневной нормы по каждому из 12 важных витаминов и 12 минералов. При этом правило «чем больше, тем лучше» не работает — избыток витаминов может быть вреднее их недостатка.");
	}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button19Click(TObject *Sender)
{
	Memo1->Show();
	Button17->Hide();
	Memo1->Clear();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button18->Hide();
	Button19->Hide();
	Button10->Hide();
	BackButton1->Show();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	BackButton->Hide();
	Memo1->Lines->Add("Омега-3 — это одно из веществ, важных для оптимального метаболизма человека, однако не способных вырабатываться организмом. Для поддержания здоровья необходимо употреблять в пищу продукты, содержащие Омега-3 жирные кислоты — в первую очередь, морскую рыбу и масла некоторых растений.Рыбий жир — это наиболее предпочтительная форма приема Омега-3, поскольку он усваивается в 5-10 раз лучше, чем жирные кислоты из льняного масла, семян чии (chia) и прочих(1). Для покрытия суточной нормы Омега-3 можно принимать как рыбий жир в капсулах, так и просто регулярно употреблять рыбу.Рыбий жир и содержащиеся в нем Омега-3 жирные кислоты борются с воспалительными процессами в организме, ускоряя восстановление и обновление тканей (включая кожу и мышцы).");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::BackButton1Click(TObject *Sender)
{
	BackButton1->Hide();
	Memo1->Hide();
	Button10->Hide();
	Button17->Show();
	Button18->Show();
	Button19->Show();
	Button20->Show();
	Button21->Show();
	Button22->Show();
	Button23->Show();
	BackButton->Show();

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button20Click(TObject *Sender)
{   Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	BackButton->Hide();
	Memo1->Show();
	Button17->Hide();
	Memo1->Clear();
	Button18->Hide();
	Button19->Hide();
	Button10->Hide();
	BackButton1->Show();
	Button10->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Memo1->Lines->Add("Витамин С — это одно из важнейших химических соединений, необходимых для функционирования человека. Роль витамина С в обмене веществ комплексна и многогранна — начиная от поддержания здоровья соединительной и костной ткани, заканчивая укреплением иммунитета и борьбой со старением.Употребление в пищу богатых витамином С продуктов положительно влияет на спортивные результаты и на рост мускулатуры. Этот витамин ответственен как за синтез коллагена и восстановление мышц после тренинга, так и за усвоение минералов и поддержание здорового уровня тестостерона и прочих гормонов.Аскорбиновая кислота (витамин С в чистом виде) не просто так имеет сладковатый вкус — в организме некоторых млекопитающих (например, кошки) этот витамин синтезируется из глюкозы.");
}
//---------------------------------------------------------------------------


void __fastcall TPersonalTrainer::Button23Click(TObject *Sender)
{
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button17->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button18->Hide();
	Button19->Hide();
	BackButton1->Show();
	BackButton->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Memo1->Lines->Add("Основное положительное свойство витамина Е – антиоксидантное действие. Благодаря ему клетки становятся более устойчивыми по отношению к внешним факторам, что, в свою очередь, способно продлевать молодость организма.Витамин Е влияет на метаболизм, улучшает питание клеток и укрепляет стенки кровеносных сосудов — при достаточном его потреблении и при адекватном уровне физических нагрузок рост мышечной массы идет более быстрыми темпами.Потребность взрослого человека в витамине Е составляет 10-15 мг в сутки – такое количество содержится в 30 г подсолнечного масла или в 100 г оливкового. Важно, что этот витамин может накапливаться в организме и вызывать интоксикацию.Больше всего витамина Е содержится в масле зародышей пшеницы (215 мг на 100 г), затем следует подсолнечное масло (56 мг), миндальное масло (40 мг), семена подсолнечника (35 мг), миндаль (26 мг) и оливковое масло (12 мг).");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button21Click(TObject *Sender)
{
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button17->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button18->Hide();
	Button19->Hide();
	BackButton1->Show();
	BackButton->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Memo1->Lines->Add("Витамин А — это главнейший компонент правильной работы иммунной системы и поддержания здорового обмена веществ. В форме ретинола витамин А входит в состав многих тканей тела человека (кожа, волосы, зубы, кости и мышцы), различными способами регулируя процессы роста и регенерации.Важным свойством витамина А является способность связывать свободные радикалы, ограничивая их негативное воздействие, замедляя процессы старения и защищая организм от роста раковых клеток. Витамин А также усиливает действие прочих антиоксидантов (в первую очередь, витамина Е).Ретинол (витамин А1) необходим кожным тканям и слизистым покровам не только для поддержания здоровья, но и для восстановления после различных повреждений. Одна из функций этого вещества — улучшение синтеза коллагена, строительного материала для соединительных тканей организма.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button22Click(TObject *Sender)
{
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button17->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button18->Hide();
	Button19->Hide();
	BackButton1->Show();
	BackButton->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button23->Hide();
	Memo1->Lines->Add("Основной функцией витамина D является обеспечение усвоения организмом кальция и фосфора. Кроме этого, витамин ответственен за процессы воспроизводства клеток, выработку ряда гормонов, правильную работу метаболизма и иммунитета в целом.Витамин D считается одним из важнейших витаминов, ответственных за здоровье человека, а его недостаток приводит к развитию множества заболеваний. При этом низкий уровень витамина D быстро сказывается на организме, понижения иммунитет и ослабляя кости.Потребность варьируется от 10 микрограмм в день для детей (доза может обозначаться как 400 IU или 400 ME) до 15 мкг в день для взрослых (600 IU). Пожилым людям старше 70 лет требуется повышенный уровень этого витамина — порядка 20 мкг в день (800 IU).");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button5Click(TObject *Sender)
{
	Label1->Hide();
	Button24->Show();
	Button25->Show();
	Button26->Show();
	Button27->Show();
	Button28->Show();
	Button29->Show();
	Button30->Show();
	Button31->Show();
	BackButton->Show();
	BackButton2->Hide();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button9->Hide();

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::BackButton2Click(TObject *Sender)
{
	BackButton2->Hide();
	Memo1->Hide();
	Button10->Hide();
	Button24->Show();
	Button25->Show();
	Button26->Show();
	Button27->Show();
	Button28->Show();
	Button29->Show();
	Button30->Show();
	Button31->Show();
	BackButton->Show();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button24Click(TObject *Sender)
{
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Button14->Hide();
	Button17->Hide();
	Button18->Hide();
	Button19->Hide();
	Button20->Hide();
	Button21->Hide();
	Button22->Hide();
	Button24->Hide();
	Memo1->Show();
	Memo1->Clear();
	Button25->Hide();
	Button26->Hide();
	BackButton2->Show();
	BackButton->Hide();
	Button27->Hide();
	Button28->Hide();
	Button29->Hide();
	Button30->Hide();
	Button31->Hide();
	Memo1->Lines->Add("Средиземноморская диета не является набором четких правил и рекомендаций, представляя собой скорее обобщение традиционных привычек питания жителей северо-востока Испании, юга Франции, Португалии, Греции, Италии и ряда других теплых Европейских стран.Основой диеты является замена животных жиров растительными маслами, потребление круп, большого количества овощей и бобовых, ежедневное употребление рыбы и морепродуктов. Эффекты — снижение уровня «плохого» холестерина и поддержание стабильного веса.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button25Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Палеодиетой (диетой «пещерного человека») называется отказ от современных продуктов питания, производимых на пищевых фабриках, и переход на традиционную пищу, известную людям веками. Название отсылает к периоду палеолита, закончившемуся 15 тыс. лет назад.Диета допускает к употреблению рыбу, птицу и мясо, яйца, овощи, фрукты, грибы и орехи. Исключаются зерна, мука и мучные продукты, бобовые, сахар, молоко, молочные продукты и обработанные растительные масла. Эффекты — улучшение самочувствия и потеря веса.");

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button26Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Глютен является белком, входящим в состав злаков; содержание в пшенице доходит до 80%, в зерне ржи — порядка 50%. Главная функция глютена при производстве продуктов питания — связывание и придание вязкости. Однако именно поэтому глютен склеивает пищу и в желудке.У некоторых людей при его употреблении нарушается работа кишечника, падает уровень усвоения витаминов, человек чувствует постоянный дискомфорт и быстро утомляется. Отказ от продуктов, содержащих глютен, может улучшить самочувствие и снять тяжесть в желудке.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button27Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Циклической кето-диетой является еженедельное повторение питания по следующему принципу: с понедельника по вечер четверга — дни строгой кето-диеты; вечер четверга, пятница и суббота — загрузочные дни высокой калорийности; воскресенье — переходной день.Соблюдение такого принципа питания на фоне специальных тренировок призвано в кротчайшие сроки сжигать избыточную подкожную жировую клетчатку. Именно по этой причине CKD диета является одной из наиболее популярных среди профессиональных спортсменов.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button28Click(TObject *Sender)
{
	Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Исследования показывают, что калории сладких напитков и десертов буквально невидимы для организма. Они словно отключают механизмы защиты от переедания — однако, получая удовольствие от стимуляции мозга сахаром, человек получает и огромное количество калорий.Среди болезней, возможно спровоцированных употреблением сахара, все чаще называют не только ожирение, но и диабет, болезнь Альцгеймера и другие серьезные заболевание. Важно понимать, что отказ от сахара — это прежде всего вопрос здоровья, а не только потери веса.");

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button29Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Последние научные работы по нейробиологии показывают, что мозг человека автономно контролирует массу тела, поддерживая вес в границе 5-7 кг от «отправной точки» (set-point) вне зависимости от уровня физической активности или даже калорийности питания.При этом set-point легко сдвинуть вверх употреблением чрезмерно калорийных продуктов, но крайне сложно понизить. Контроль за голодом и привычка есть только тогда, когда этого хочется — один из важнейших способов поддерживать вес тела даже при отсутствии диет.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button30Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Согласно последним научным данным, даже здоровым людям рекомендуется исключить употребление мясных полуфабрикатов и колбас, сократив суммарное потребление красного мяса до 300-500 граммов в неделю. Причина — содержащиеся в мясе вредные ферменты.Учитывая и то, что промышленная курятина перегружена гормонами, а рыба загрязнена ртутью, отказ от мяса все чаще случается не по религиозным соображениям. Эффект (при контроле за потреблением растительного белка) — улучшение самочувствия и пищеварения.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button31Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Memo1->Lines->Add("Строго говоря, белковой диеты, как таковой, не существует. Несмотря на то, что многие режимы питания в той или иной форме рекомендуют повышенное употребление протеина, не одна из подобных диет не носит официального названия «белковая». Можно даже сказать, что любая диета, ограничивающая количество углеводов в рационе, в какой-то мере может считаться белковой — даже высокожировые диеты строятся на том, что существенное количество энергии должно покрываться за счет белковых продуктов и жирного мяса.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button32Click(TObject *Sender)
{
Memo1->Clear();
Memo1->Show();
int z;
z=StrToInt(Edit1->Text);
if(z<17&&z>0) Memo1->Lines->Add("Вы являетесь ЭКТОМОРФОМ!!!Эктоморф — один из трех наиболее часто встречающихся типов телосложения (соматотипов), характеризующийся худобой и сложностью с набором веса (как мышц, так и жира). Люди такого типа отличается высокой скоростью метаболизма и обмена веществ.При постоянном неправильном питании и малоподвижном образе жизни эктоморфы все же набирают лишний вес — в этом случае у них появляется животик, тогда как остальное тело (особенно руки и ноги) продолжают быть чрезвычайно худыми.Большинство звезд и профессиональных моделей являются эктоморфами — то, что набор веса дается им с трудом, помогает набирать исключительно мышцы, а не жировую ткань. Подтянутое и спортивное тело с хорошим рельефом — легкая задача для эктоморфа.");
else if(z>17&&z<20) Memo1->Lines->Add("Вы являетесь МЕЗОМОРФОМ!!!Мезоморф — один из трех типов телосложения человека. Главная характеристика мезоморфов — мускулистая фигура от природы. Во всем мире лишь 10-15% людей являются мезоморфами, однако большинство профессиональных атлетов и фитнес-моделей обладают именно таким соматотипом.Мезоморфы обычно имеют повышенный уровень тестостерона и быстрый метаболизм на фоне хорошего аппетита — это позволяет легко набирать мышечную массу. Однако их главной проблемой является то, что они относятся к своему спортивному телу как «к должному», и с возрастом часто теряют форму.Мезоморфы должны уделять особое внимание количеству насыщенных животных жиров в рационе и не превышать границу в 10-15 г таких жиров на каждую 1000 ккал.");
else if(z>20) Memo1->Lines->Add("Вы являетесь ЭНДОМОРФОМ!!!Эндоморф — это один из трех типов телосложения человека. Фигура классических эндоморфов характеризуется массивной костной структурой, достаточно широкой талией и, к сожалению, избыточным жироотложением. Метаболизм у эндоморфов замедленный, силовые показатели низкие.Считается, что эндоморф — самый распространенный тип телосложения среди европейских наций. Скорее всего, эволюция позаботилась о том, чтобы во время холодной зимы и ограниченного доступа к еде люди могли выживать за счет набранных за теплое время года жировых запасов.Фигура эндоморфа часто имеет шарообразную или грушевидную форму, поскольку их таз шире, чем плечи. Конечности при этом могут быть относительно короткими или, что встречается реже, длинными.");
else if (z<0) Memo1->Lines->Add("Шутник,не шути так больше.Введи правильное значение :)");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button1Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
BackButton->Show();
Edit1->Show();
Button32->Show();
Label2->Show();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button3Click(TObject *Sender)
{

	Button33->Show();
	Button34->Show();
	Button35->Show();
	Button36->Show();
	Button37->Show();
	Button38->Show();
	Button39->Show();
	BackButton->Show();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Label1->Hide();
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button33Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Если фильм подразумевает возмужание персонажа, то одним из обязательных моментов будет нарезка из домашних тренировок в виде отжиманий и подтягиваний — две минуты нарезки кадров выполнения этих упражнений с бодрой музыкой и героя практически не узнать.В реальности подтягиваниями и отжиманиями от пола можно провести разминку — но о поддержании или наборе формы говорить нельзя. Чтобы набрать хоть сколько либо заметную мышечную массу дома, необходимы не только гантели, но и штанга с набором весов.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::BackButton3Click(TObject *Sender)
{
	BackButton3->Hide();
	Memo1->Hide();
	Button33->Show();
	Button34->Show();
	Button35->Show();
	Button36->Show();
	Button37->Show();
	Button38->Show();
	Button39->Show();
	BackButton->Show();
	BackButton2->Hide();
	}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button34Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Почти во всех голливудских фильмах девяностых и двухтысячных годов бегуны занимались джогингом исключительно в толстовках и различного типа кофтах с капюшонами. Ярким примером может стать персонаж Рокки Бальбоа в исполнении Сильвестра Сталлоне.На самом деле, бегать в кофте из хлопка настоятельно не рекомендуется, поскольку она не обеспечивает циркуляции воздуха. Впитав пот, кофта начнет как перегревать тело, так и пропускать холодный воздух. Помните о том, что зимой нужно бегать в специальной одежде.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button35Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Если герой на экране занимается спортом, то он должен выглядеть так, что он действительно занимается спортом — тренировки словно длятся часами и проходят на грани физической возможности. По их окончанию герой обливается потом и выглядит полностью вымотанным.дарные и продолжительные тренировки для неподготовленного организма являются одной из наиболее распространенных причин спортивных травм. Помните о том, что в реальной жизни не нужно торопиться и ни в коем случае не нужно тренироваться на «последнем издыхании».");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button36Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Упражнением, наиболее востребованным режиссерами фильмов, однозначно являются отжимания от пола. Во-первых, оно позволяет показать работу почти всех мышц тела актера, во-вторых, зрители однозначно его считывают (в отличии, например, от жима штанги лежа).Мнение, что отжимания от пола должны составлять основу любой тренировочной программы, поскольку каждый супергерой делает это упражнение — глубоко ошибочно. Помните о том, что есть только причина, по которой актер делает это упражнение на экране — это «эффектно».");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button37Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Если же герой (или героиня) худеет по сюжету фильма, то обязательным элементом программы на похудание станет выполнение классических подъемов туловища на пресс с тренером, придерживающим ноги. Персонаж при этом обязательно должен вспотеть.На самом деле никакие упражнения на пресс не способны сжечь жировые отложения в этой области — сколько бы вы не выполняли скручивания, живот таким образом убрать не получится. Первое, с чего начинается похудение — это грамотно составленный план питания.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button38Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Попробуйте вспомнить хоть один фильм, в котором актер делал становую тягу или приседания со штангой. Силовая тренировка на экране чаще всего состоит из напряженных подъемов гантелей на бицепс, подтягиваний на перекладине, скручиваний и отжиманий от пола.Как и во всех других случаях, режиссеры избегают показывать реальный тренировочный процесс по причине того, что это не так «эффектно» и «сексуально» как подъемы на бицепс или отжимания. Однако делать вывод, что тренироваться нужно только так — ошибка.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button39Click(TObject *Sender)
{
Button1->Hide();
Button2->Hide();
Button3->Hide();
Button4->Hide();
Button5->Hide();
Button6->Hide();
Button7->Hide();
Button8->Hide();
Button9->Hide();
Button11->Hide();
Button12->Hide();
Button13->Hide();
Button14->Hide();
Button17->Hide();
Button18->Hide();
Button19->Hide();
Button20->Hide();
Button21->Hide();
Button22->Hide();
Button24->Hide();
Memo1->Show();
Memo1->Clear();
Button25->Hide();
Button26->Hide();
BackButton2->Show();
BackButton->Hide();
Button27->Hide();
Button28->Hide();
Button29->Hide();
Button30->Hide();
Button31->Hide();
Button33->Hide();
Button34->Hide();
Button35->Hide();
Button36->Hide();
Button37->Hide();
Button38->Hide();
Button39->Hide();
BackButton3->Show();
Memo1->Lines->Add("Как бы усиленно герой не тренировался на экране, как бы активно по сюжету он не набирал мышечную массу, вы никогда не встретите кадра, как он смешивает протеиновый шейк. В лучшем случае, он будет пить воду, кока-колу или ее «спортивный» вариант — Powerade.Вероятно, создатели фильмов просто боятся ввести массового зрителя в заблуждение — увидев, как герой принимает «непонятные субстанции» типа креатина, многие могут подумать, что это стероиды. Однако реальный набор мышц без спортивного питания почти не возможен.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button2Click(TObject *Sender)
{
	Button40->Show();
	Button41->Show();
	Button42->Show();
	Button43->Show();
	Button44->Show();
	Button45->Show();
	Button46->Show();
	Button47->Show();
	Button48->Show();
	Button49->Show();
	BackButton->Show();
	Button1->Hide();
	Button2->Hide();
	Button3->Hide();
	Button4->Hide();
	Button5->Hide();
	Button6->Hide();
	Button7->Hide();
	Button8->Hide();
	Label1->Hide();
}
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button40Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.АРМЕЙСКИЙ ЖИМИсходное положение упражнения: В положении сидя или стоя слегка прогнитесь в пояснице и возьмитесь за штангу прямым хватом, расставив руки чуть шире плеч. Опустите локти книзу, удерживая штангу на уровне ключиц. Ноги стоят параллельно друг другу.Упражнение: Выжмите штангу над головой, полностью распрямив руки в локтях. Медленно опустите штангу в исходное положение. Не задирайте голову. Смотрите строго перед собой.2.ЖИМЫ ШТАНГИ ИЗ-ЗА ГОЛОВЫ СТОЯ или СИДЯИсходное положение: В положении сидя возьмитесь за штангу прямым хватом так, чтобы ваши предплечья были точно параллельны друг другу и строго перпендикулярны полу. Держите голову прямо; ни в коем случае не наклоняйте ее вперед. Выпрямив корпус и слегка прогнувшись в пояснице, опустите гриф штанги на верхнюю часть трапециевидных мышц.Упражнение: Подконтрольным движением поднимите штангу над головой, полностью распрямив руки в локтях. Медленно опустите штангу в исходное положение.3.РАЗВЕДЕНИЕ РУК С ГАНТЕЛЯМИ В ПОЛОЖЕНИИ СТОЯВыполнение: Возьмите гантели в каждую руку, слегка наклонитесь вперед и вытяните опущенные руки перед собой. Начинайте каждое повторение с четкой остановки, чтобы не делать махов гантелями. Поднимите гантели вверх и в стороны, слегка повернув запястья, словно наливаете воду из кувшина (так, чтобы задняя часть гантели была выше передней). Поднимите гантели немного выше плеч, затем медленно и плавно опустите их вниз. ");
}
//---------------------------------------------------------------------------


void __fastcall TPersonalTrainer::BackButton4Click(TObject *Sender)
{
Button40->Show();
Button41->Show();
Button42->Show();
Button43->Show();
Button44->Show();
Button45->Show();
Button46->Show();
Button47->Show();
Button48->Show();
Button49->Show();
BackButton->Show();
BackButton4->Hide();
Memo1->Hide();
}
//---------------------------------------------------------------------------
void __fastcall TPersonalTrainer::Button41Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Тяга штанги к подбородку.Отделяет мышцы трапеции от дельт. Акцент на средних дельтах + верх и середина трапеций...Возьмите штангу хватом сверху и станьте ровно. Чем шире хват, тем больше нагрузки уходит в дельты, чем уже, тем больше напрягаются трапеции. В исходной позиции спина выпрямлена и слегка прогнута в пояснице,, руки выпрямлены в локтях, гриф касается бедер.Напрягите мышцы шеи и трапеции, затем разводя локти, потяните штангу вертикально вверх (Движение «ведут» именно локти). Гриф штанги скользит вдоль тела от бедер до подбородка. В верхней точке локти выше плеч. Затем плавно опустите штангу в исходное положение. Темп упражнения — медленный и без рывков.2.Шраги со штангой.Базовое упражнение на толщину мышц верха трапеции.Поставьте ноги на ширине плеч и возьмитесь за штангу хватом сверху. Хват на ширине плеч. Выпрямитесь (грудь расправлена, прогиб в пояснице. Руки выпрямлены и держат штангу. Напрягите трапеции и потяните плечи вверх, по направлению к ушам. Представьте, что вы просто пожимаете плечами, когда вас спрашивают о чем-то. Ваша задача — поднять плечи в вертикальной плоскости как можно выше, сохраняя при этом все остальные части неподвижными. Подняв плечи максимально вверх задержитесь на пару секунд в этом положении. Затем плавно опустите плечи в исходное положение.3.Шраги с гантелями для мышц трапеции«Поднимает» верх и середину трапеции. Шраги с гантелями (по сравнению со штангой) позволяют гораздо глубже проработать верх трапеций.Станьте прямо и возьмите в обе руки тяжелые гантели. Они свободно свисают на выпрямленных руках по бокам бедер. Немного подайте их вперед и отведите плечи назад.Сделайте вдох, и поднимите плечи как можно выше напрягая трапеции. Поднимайте плечи строго вверх, и не сгибайте руки в локтях. Поднимайте их исключительно усилием трапеций. Подняв плечи максимально вверх, еще сильнее напрягите трапеции на пару секунд. Плавно опустите плечи в исходную позицию.Чем выше вы поднимаете плечи, тем сильнее сокращаются верхние мышцы трапеции и поднимающие лопатку мышцы, что приведет к набору мышечной массы. Используйте тяжелые веса, но не жертвуйте амплитудой. Не вращайте плечами и не поднимайте их по диагонали. Это опасно!");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button42Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Подъем штанги на бицепс стоя.Возьмите штангу хватом снизу на ширине плеч. В стартовой позиции гриф находится возле бедер. Сделав глубокий вдох и задержав дыхание, сгибайте руки в локтях, поднимая штангу к плечам. В верхней точке задержитесь и напрягите бицепсы, затем медленно и подконтрольно опускайте штангу вниз в стартовое положение. Так как это упражнение на руки является базовым, используйте большой вес, но без ущерба для техники. Ни в коем случае не бросайте штангу вниз, а опускайте ее медленно, обратите особое внимание на последний отрезок движения. В последних нескольких повторениях сета допускается незначительный «читинг».2.Попеременный подъем гантелей на бицепс «Молот»В исходном положении руки с гантелями опущены вниз, хват нейтральный, гантели слегка касаются бедер. В таком положении, контролируя движение и не супинируя кисть, поднимите гантель одной рукой до уровня плеч. В верхней точке напрягите бицепс, затем медленно опустите руку с гантелью в исходное положение. Следите, чтобы кисть при этом не проворачивалась; прочувствуйте, как сокращается и растягивается бицепс от предплечья до плеча. Затем выполните повторение другой рукой.3.Попеременный подъем гантелей на бицепс с супинациейПочему это упражнение на руки нужно выполнять именно с супинацией? Потому, что супинация активизирует бицепс по всему объему В бодибилдинге это упражнение считается одним из самых ударных средств для развития бицепсов и других мышц-сгибателей локтевого сустава. Упражнение на руки выполняется как стоя, так и сидя на краю горизонтальной скамьи. Но все же наилучшим вариантом я считаю подъем на скамье со спинкой, наклоненной под углом 60º (на 30º меньше прямого). При таком варианте бицепс получает возможность больше растягиваться в нижней точке, а его длинная головка получает более мощную нагрузку. Если спинка скамьи установлена под прямым углом, упражнение практически не отличается от подъема штанги на бицепс стоя.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button43Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Отжимания в упоре сзади.Подбирая упражнения на трицепс в домашних условиях рекомендуем обратить внимание на данное упражнение.Упражнение на трицепс: отжимания в упоре сзади.Исходное положение:Упереться руками сзади о гимнастическую скамью. В домашних условиях можно использовать два табурета. Ноги вытянуть перед собой на полу или другой скамье.Выполнение:На вдохе нужно опуститься вниз, чтобы руки согнулись до прямого угла. На выдохе – поднять тело вверх и выпрямить руки.Рекомендации:Для увеличения нагрузки можно делать паузы в нижнем и верхнем положении. Не следует расставлять руки слишком широко, так как в этом случае основная нагрузка будет приходиться на дельтовидные и грудные мышцы.2.Разгибание рук из-за головы.Упражнение на трицепс: разгибание рук из-за головыСейчас рассмотрим, как накачать трицепс гантелями. Упражнения на трицепс с гантелями отлично подходят для домашних тренировок. Если на какой-то руке мышца отстает, её можно прорабатывать этим упражнением.Исходное положение:Сесть на скамью или табурет, выпрямиться, спину прогнуть в пояснице, ступни ног плотно прижать к полу. Руку с гантелей поднять над головой, локоть распрямить. Хват естественный. Вторая рука обхватывает туловище.Выполнение:После вдоха опускать руку с гантелей за голову, не делая паузу в конечном положении руки. Груз необходимо подбирать таким образом, чтобы не делать упражнение больше 10-12 раз.Рекомендации:Важно следить за тем, чтобы не двигался плечевой сустав. Если сначала это не получается, можно придерживать плечо второй рукой.");


}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button44Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Жим штанги на наклонной скамье.Базовое упражнение для груди, для развития силы и общей массы грудных мышц. В этом упражнении используются самые высокие рабочие веса, что делает его весьма эффективным для проработки мышц грудного массива. Это самое мощное упражнение на грудь и «точка отсчета» нагрузки для груди. Выполняя его первым вы убиваете сразу трех зайцев:1.Акцентируете внимание на сложно растущих верхних отделах.2. Получаете возможность легко отслеживать нагрузку путем увеличения весов на штанге.3. Кроме того, наклон вверх, «ворует» нагрузку у трицепса для груди.Варьирование ширины хвата позволяет акцентировать нагрузку по ширине груди – на наружную, среднюю или внутреннюю часть верха груди; обычно используется хват, чуть шире плеч. Наклон скамьи – 35 градусов. Амплитуда – усеченная: не касайтесь грифом груди внизу, и не выпрямляйте локти до конца вверху.2.Жим гантелей на наклонной скамье.Эффективное упражнение для развития объема и придания мышцам груди хорошей формы. Так же как и жим штанги, хорошо развивает мышцы верхнего плечевого пояса вообще, хотя главный акцент нагрузки -на верхней части груди.В жиме гантелей, не сокращайте амплитуду. Это не жим штанги. Растяжка в нижней позиции – обязательна. А для этого нужно выбрать тяжелый, но управляемый вес гантелей. Наклон обычно такой же, как и в жиме штанги.3.Разведение гантелей на наклонной скамье.Это формирующее упражнение на верхнюю часть груди. Главным секретом этого упражнения является – отход от «крестообразного» положения рук, обязательного для других упражнения на грудь.Выжав гантели, попробуйте очень медленно, не теряя равновесия, опускать их на прямых руках вниз, по направлению к тазу. Достигнув той точки, ниже которой вы уже не сможете удерживать гантели, вы получите точку проекции (вниз, по вектору силы тяжести) плоскости движения. Выполнение упражнения для груди в такой двигательной плоскости хорошо нагружает верх грудных мышц, особенно в растянутом положении.Амплитуда – полная. Растяжка в нижней позиции обязательна. Наклоны скамьи могут быть самые различные. От отрицательных (-30 градусов), до классических позитивных (35 -45 градусов). Рекомендуется чередовать наклоны и не гнаться за весом.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button45Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1. Скручивания.Это стандартное упражнение на пресс. Именно во время выполнения скручиваний включаются в работу прямая мышца брюшного пресса (она отвечает за кубики на животе), большая грудная мышца, наружные и внутренние косые, а также поперечные мышцы брюшного пресса.Выполнение. Следите за тем, чтобы средняя и нижняя части спины были прижаты к полу. Таким образом вы избегаете подключения к работе сгибающих мышц бедра. Руки старайтесь держать у висков, не тянитесь вверх подбородком и шеей. Поднимать вас должны мышцы пресса. На подъёме следует делать глубокий выдох, вдох — в нижнем положении.Выполните три подхода по 30 раз.2. Ножницы.Это упражнение направлено на проработку нижнего пресса (абдоминальной части). Мышцы, задействованные при выполнении этого упражнения: подвздошно-поясничная мышца, напрягатель широкой фасции, портняжная мышца, прямая мышца бедра, длинная и короткая приводящие мышцы, гребенчатая мышца, прямые, косые и поперечные мышцы живота, квадрицепсы.Выполнение. Лягте на пол, руки вытяните вдоль тела и прижмите к полу. Приподнимите ноги над полом и выполните скрещивающиеся движения. Во время выполнения упражнения следите за тем, чтобы поясница была прижата к полу. Чем ниже будут опущены ноги, тем больше нагрузка на нижний пресс. Если вам сложно держать ноги на таком уровне, поднимите их немного выше. Если чувствуете, что поясница отрывается от пола, поднимите ноги чуть выше. Следите за тем, чтобы ноги были выпрямлены.Выполните три подхода по 30 секунд каждый.3. Водолаз.Это упражнение также направлено на проработку нижнего пресса (абдоминальной части). Мышцы, задействованные при выполнении этого упражнения: подвздошно-поясничная мышца, напрягатель широкой фасции, портняжная мышца, прямая мышца бедра, длинная и короткая приводящие мышцы, гребенчатая мышца, прямые, косые и поперечные мышцы живота, квадрицепсы.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button46Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Подтягивания широким хватом.Вариант 1: виснем на турнике с хватом шире плеч. Грудь подаем вперед, скрещиваем лодыжки, взгляд на перекладину и, сводя вместе лопатки, подтягиваемся. Идеал: касание грудью турника и задержание в такой позиции каждый раз на 2 секунды.Вариант 2: все-то же самое, но ноги не скрещиваем, голову опускаем вниз, а касание производим задней частью шеи.2.Тяга гантелей в наклоне.В одну руку гантелю, другую – на скамью. Колено противоположной стороны тоже на скамью. Наклон параллельный скамье. Начинаем движение: сводим лопатки, тянем гантель на себя по дуге. В верхней точке четкая пауза, после – возвращение в исходную. Повторяем 8-12 раз.3.Тяга штанги в наклоне.Здесь нужно просто наклониться параллельно полу и тянуть штангу на себя. Важной особенностью является тяга именно к животу, чтобы загрузить спину, а также отсутствие пауз в верхней точке. Чтобы уменьшить нагрузку на поясницу ее нужно прогнуть, а ноги чуть согнуть в коленях.4.Тяга блока сидя.Выполняется широким хватом. Ставим ноги на опору, чуть сгибаем. Берем длинную рукоять прямым широким хватом. Далее нужно поднять голову и прогнуть спину. Упражнение выполняется сведением лопаток и оттягиванием рукояти к середине живота. Теперь делаем паузу и возвращаемся в исходное положение.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button47Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("Сгибание рук со штангой хватом сверху.Выполняется аналогично подъему штанги на бицепс, только штанга берется хватом сверху. Основная нагрузка ложится на брахирадиалис, кроме того работают брахиалис и бицепс. Вес штанги в данном упражнении будет гораздо меньше, чем при обычных подъемах на бицепс, так как брахирадиалис значительно слабее бицепса.Сгибания Зоттмана.Данное упражнение задействует те же мышцы, что и предыдущее, только выполняется с гантелями. Внизу гантели удерживаются, как при подъемах молот, а по мере их движения вверх происходит поворачивание кистей ладонями вниз (пронация). Затем гантели опускаются вниз, повторяя все движение в обратном порядке.Сгибание рук в запястьях стоя со штангой за спиной.Нужно встать спиной к стойке для штанги, ладони смотрят назад. Взять штангу со стоек и выполнять сгибания-разгибания кистей не сгибая рук в локтях. Упражнение также развивает мышцы - сгибатели запястья.Разгибание рук в запястьях.Садитесь на скамейку, предплечья положите на скамью либо на колени так, чтобы кисти свободно свешивались с них ладонями вниз. Берете штангу хватом сверху и поднимаете кисти вверх, затем опускаете вниз. Упражнение прорабатывает разгибатели запястья.Вращение рукоятки с подвешенным грузом.Во многих залах имеется тренажер для развития мышц предплечий - вращающаяся рукоятка, к которой на тросике может прикрепляться груз разного веса. Нужно обхватить эту рукоятку хватом сверху и производить ее вращение, наматывая тросик на рукоятку, до полного подъема груза вверх. Затем, производя вращение в обратную сторону, опустить груз на место. Вращать рукоятку можно двумя способами - к себе и от себя. В первом случае упражнение задействует разгибатели предплечья, во втором - сгибатели. Кроме того данное упражнение очень эффективно для развития силы хвата.");

}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button48Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("1.Приседания.В исходном положении ноги чуть шире плеч, ступни слегка развернуты наружу, спина должна быть выпрямлена, голова приподнята, торс напряжен. Приседайте настолько глубоко, насколько можете, а не только до параллели с полом. Не используйте «отбив» вверх из нижнего положения. Не форсируйте рост отягощений в этом упражнении до тех пор, пока не «поставите» правильную технику.Можно ли «накачать» мощные квадрицепсы, не прибегая к помощи такого популярного упражнения для ног, как приседания со штангой на спине? Можно. Хотя эффективность других упражнений и ниже, чем у приседаний.2.Жим ногами.Прекрасный выбор для построения массивного бедра, если по причине травм или анатомических особенностей вы не можете делать полноценные приседания... Это сложное позволяет загрузить мышцы тяжелыми отягощениями. Другая причина популярности этого упражнения для ног — возможность широко варьировать положение ступней, меняя фокус нагрузки между различными участками бедер (квадрицепсами, бицепсами бедра и ягодичными).Исходное положение упражнения — ноги на ширине плеч посередине платформы, носки слегка развернуты наружу.Крепко держимся руками за ручки по бокам сиденья, для придали торсу устойчивого положения, выжимаем платформу вверх. В верхней точке не разгибаем до конца колени, чтоб не расслаблять квадрицепсы. Секундная пауза.Затем медленно опускаем платформу с отягощением вниз, сгибая ноги, в конечном положении колени почти уперты в грудь. Контролируйте, чтоб ягодицы и низ спины не теряли контакт с сиденьем.3.Гакк-приседания.Имеются в виду приседания в Гакк-машине. В этом упражнении для ног и бедер нагрузка снимается со спины и направляется на колени, если работать с большим весом отягощения. А вот при работе в высоком диапазоне повторений (20-40) большой нагрузки на колени вы уже испытывать не будете.");
}
//---------------------------------------------------------------------------

void __fastcall TPersonalTrainer::Button49Click(TObject *Sender)
{
Button40->Hide();
Button41->Hide();
Button42->Hide();
Button43->Hide();
Button44->Hide();
Button45->Hide();
Button46->Hide();
Button47->Hide();
Button48->Hide();
Button49->Hide();
BackButton4->Show();
Memo1->Clear();
Memo1->Show();
Memo1->Lines->Add("Подъемы на носки в положении стоя.Подъемы на носки — проверенное временем упражнение для наращивания общей мышечной массы на икрах, особенно в области икроножной мышцы. Для его выполнения зафиксируйте плечи под подушками тренажера и встаньте на подушечки стоп на блок внизу, расставив ноги приблизительно на ширину плеч.Ноги должны быть полностью прямыми за исключением небольшого сгибания в коленях, чтобы снять нагрузку с сустава. Во время выполнения упражнения колени должны оставаться полусогнутыми.Медленно двигайтесь вниз, опуская пятки по направлению к полу. Когда вы достигнете полной амплитуды движений и почувствуете глубокое растягивание мышц икр, выполните обратное движение, поднимитесь вверх на подушечках стоп и максимально сожмите мышцы.3.Подъемы на носки в положении сидя.Еще одним прекрасным упражнением в любой программе тренировки мышц икр считаются подъемы на носки в положении сидя, которые развивают камбаловидную мышцу. Благодаря этому упражнению можно прибавить икре ширины (если смотреть спереди) и толщины (если смотреть сбоку).Зафиксируйте подушками тренажера колени (не бедра) и поставьте стопы на платформу внизу на ширине плеч. Как и в варианте упражнения в положении стоя используйте полную амплитуду движения — вы должны чувствовать, как растягиваются мышцы и сильно сжимать икры в верхней точке. Не покачивайте ногами!3.Подъемы на носки на тренажере для выполнения жима ногами.Еще одно отличное упражнение для общего наращивания мышечной массы — подъемы на носки на тренажере для выполнения жима ногами. Обычно они выполняются на тренажере для жима ногами со спинкой под углом 45 градусов и являются прекрасным выходом в том случае, когда нужные тренажеры заняты или отсутствуют.Секрет, который отличает этот вариант от других рассмотренных выше, в том, чтобы поддерживать в будрах угол максимально приближенный к 90 градусам. При правильном выполнении мышцы икр будут растягиваться просто невероятно.Сядьте в тренажер, поставьте ноги на ширине плеч и немного согните их в коленях — все как при выполнении этого упражнения в положении стоя. Опускайте груз, чтобы растянуть мышцы, затем медленно поднимите его для интенсивного сокращения.");
}
//---------------------------------------------------------------------------

